export const AllGovernments =[
        {
            "id": 1,
            "name": "القاهرة"
        },
        {
            "id": 2,
            "name": "الجيزة"
        },
        {
            "id": 3,
            "name": "الإسكندرية"
        },
        {
            "id": 4,
            "name": "اسوان"
        },
        {
            "id": 5,
            "name": "اسيوط"
        },
        {
            "id": 6,
            "name": "الأقصر"
        },
        {
            "id": 7,
            "name": "الاسماعيلية"
        },
        {
            "id": 8,
            "name": "البحر الاحمر"
        },
        {
            "id": 9,
            "name": "البحيرة"
        },
        {
            "id": 10,
            "name": "الدقهلية"
        },
        {
            "id": 11,
            "name": "السويس"
        },
        {
            "id": 12,
            "name": "الشرقية"
        },
        {
            "id": 13,
            "name": "الغربية"
        },
        {
            "id": 14,
            "name": "الفيوم"
        },
        {
            "id": 15,
            "name": "القليوبية"
        },
        {
            "id": 16,
            "name": "المنوفية"
        },
        {
            "id": 17,
            "name": "المنيا"
        },
        {
            "id": 18,
            "name": "الوادي الجديد"
        },
        {
            "id": 19,
            "name": "بني سويف"
        },
        {
            "id": 20,
            "name": "بورسعيد"
        },
        {
            "id": 21,
            "name": "جنوب سيناء"
        },
        {
            "id": 22,
            "name": "دمياط"
        },
        {
            "id": 23,
            "name": "سوهاج"
        },
        {
            "id": 24,
            "name": "قنا"
        },
        {
            "id": 25,
            "name": "كفر الشيخ"
        },
        {
            "id": 26,
            "name": "مطروح"
        }
    ]
